# Operações com índices Multiplos.

In [51]:
import pandas as pd
import numpy as np
from random import randint as rd

In [52]:
grupo = ['A','A','A','B','B','B',]
valor = [1,2,3,1,2,3]
valor

[1, 2, 3, 1, 2, 3]

In [53]:
tba = list(zip(grupo, valor))
tba = pd.MultiIndex.from_tuples(tba)
tabela = pd.DataFrame(np.random.randn(6, 2), index=tba, columns=['Jeff', 'Ray'])
tba

MultiIndex([('A', 1),
            ('A', 2),
            ('A', 3),
            ('B', 1),
            ('B', 2),
            ('B', 3)],
           )

In [54]:
tabela

         Jeff       Ray
A 1 -0.575132  0.966846
  2  1.629452 -0.618837
  3 -1.191391  1.040689
B 1 -0.592613  0.455907
  2 -1.677600 -1.240544
  3  0.910066  0.796660

In [55]:
tabela['Ray'] > 0.5

A  1     True
   2    False
   3     True
B  1    False
   2    False
   3     True
Name: Ray, dtype: bool

In [56]:
tabela['Jeff'] > 0.3

A  1    False
   2     True
   3    False
B  1    False
   2    False
   3     True
Name: Jeff, dtype: bool

In [57]:
tabela['Jeff'] > 0.3

A  1    False
   2     True
   3    False
B  1    False
   2    False
   3     True
Name: Jeff, dtype: bool

In [58]:
tabela.loc['A']

       Jeff       Ray
1 -0.575132  0.966846
2  1.629452 -0.618837
3 -1.191391  1.040689

In [59]:
tabela.loc['B']

       Jeff       Ray
1 -0.592613  0.455907
2 -1.677600 -1.240544
3  0.910066  0.796660

In [61]:
tabela.loc['B'] > 0.4

    Jeff    Ray
1  False   True
2  False  False
3   True   True

In [62]:
tabela.index.names = ['Grupo','Ns']
tabela

              Jeff       Ray
Grupo Ns
A     1  -0.575132  0.966846
      2   1.629452 -0.618837
      3  -1.191391  1.040689
B     1  -0.592613  0.455907
      2  -1.677600 -1.240544
      3   0.910066  0.796660

In [63]:
tabela.xs(2, level='Ns')

           Jeff       Ray
Grupo
A      1.629452 -0.618837
B     -1.677600 -1.240544